{
  "about": [
    "Hi, I am Hsu Ting. I am a website engineer. I have a lot of experience for making websites. I use \"React\" to build the front end of websites, use \"koa\" to build the back end of websites. I am also familiar with \"AWS\", \"heroku\" and so on. As a result, Deploying websites to servers is not difficult to me. Besides website design, I use \"jest\" to check the coverage of code and test whether all events are right or not. \"eslint\" is used for checking my code style does not have any unnecessary code. However, \"CI\" is not familiar with me. I use \"travis\" to run my public projects and \"circleci\" to run my private projects.",
    "As a engineer, keeping learning is the most important thing. As a result, I always focus on the newest technological advancements. \"react\", \"relay\" and \"graphl\" are fields where I have focused much attention. Coding has became one of my life, but my life is not just coding. Pencil drawing, cooking, bartending and so on are also my interest."
  ],
  "frontEnd": {
    "title": "FRONT-END",
    "content": [
      "In the front end, I use \"react\" to build the base of websites. \"react-redux\" is used to handle the data in the front end. Use \"react-router-dom\" to build declarative routing. The module I use to connect to servers is \"relay\". I use \"relay\" to get data and mutation data to servers. Besides those popular modules, I also write a module, \"cat-components\", to help me build websites quickly. \"cat-components\" is a module which use \"radium\" to handle style.",
      "For me, I does not think the way I use to build websites is the best way to building websites. However, this way is perfect for me. I can use those modules to build any website I want quickly. I also do my best to learn other newest modules to help me improve the way I use to build websites."
    ]
  },
  "backEnd": {
    "title": "BACK-END",
    "content": [
      "In the back end, I use \"koa\" to build my servers. I does not write \"RESTful API\", right now. I write \"graphql\" to replace \"RESTful API\". \"graphql\" is not very popular, now. However, I think it will be a best way to handle data. It is very difficult to learn \"graphql\" but easy to maintain it. That is why I choose \"graphql\" instead of \"RESTful API\".",
      "To deploy my project, I use \"docker\" to help me deploy my project to servers. Writing a \"Dockerfile\" is easy to me and I write \"bash script\" to deploy more easily. When I need to delpy to servers, I will choose to use \"heroku\" or \"AWS\". \"heroku\" is very easy, but it does not have database for free. As a result, I use \"firebase\" to be my database when I use \"heroku\".",
      "I spend more time on learning the front end then the front end of websites. However, I still do my best to make my servers more prefect. As a result, I still learn more newset technological advancements and improve my skills."
    ]
  },
  "github": "NEWEST PROJECT",
  "works": [{
    "title": "Una timer",
    "img": "una-timer.png",
    "link": "https://hsuting.github.io/Una-timer/"
  }, {
    "title": "dehua",
    "img": "dehua.png",
    "link": "http://www.22227070.com.tw/"
  }, {
    "title": "exedesign",
    "img": "exedesign.png",
    "link": "http://antervic.com/"
  }, {
    "title": "xunmihoney",
    "img": "xunmihoney.png",
    "link": "http://xunmihoney.com/"
  }],
  "workButton": "MORE WORKS"
}
